---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatUnConnError
source: html/d2d38abc-e75f-9031-7cdf-5a98f9747ed3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartCannotChangeTypeIncompatUnConnError Property

The selected fitting(s) cannot successfully change the type. The newly selected fabrication part type either has no material or has badly configured dimensions, resulting in bad geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartCannotChangeTypeIncompatUnConnError { get; }
```